using System;
using System.Collections.Generic;

namespace Webdiyer.MvcPagerDemo.Models
{
    public static class DemoData
    {
        public static List<Article> AllArticles
        {
            get
            {
                var arts = new List<Article>();
                arts.Add(new Article
                    {
                        Title = "吴起热线—吴起人自己的地方门户网站",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 7, 6, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "延安市吴起县境内古城投资三亿欲变陕北名镇",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 7, 5, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "延安市居住证首发仪式在吴起举行",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 7, 5, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "黄土高原上的绿色丰碑——吴起县生态环境建设巡礼",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 7, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起的追梦之旅——吴起县争创“全国百强县”纪实",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 7, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "延安铁边城入选第七批全国重点文保单位",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 7, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起：现代农业蓬勃发展",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 28, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起打造“绿色革命”圣地",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 27, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴华路二级公路施工期间实行交通管制的通告",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 12, 11, 22, 33)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县：加快发展旅游业 打造经济发展新引擎",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 6, 12, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起将举办四国男篮赛 国奥男篮“牵手”残疾儿童",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起被列为全国首批、全省唯一的农村改革试验区",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "陕西省延安市吴起县",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起打造“绿色革命”圣地",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "四国篮球争霸赛将在吴起举行",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "土地广阔、资源丰富、景区众多的延安吴起县",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起再次荣获中国中小城市双“百强县”称号",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起率先在全市建成省级生态县",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起农民的现代化信息生活",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 6, 1, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "延安吴起实施新一轮退耕还林",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 5, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "陕西吴起:中国“退耕还林第一县”",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 5, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "延安市吴起县",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 4, 26, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县大力推进生态文明建设",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 4, 8, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "我县文艺表演节目在《我要上春晚》栏目播出通知",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 4, 2, 10, 33, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起镇关于开展辖区内45岁以上居民免费体检的通知",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 3, 2, 18, 39, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "关于在全镇范围内开展麻疹疫苗强化免疫活动的通知",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 3, 2, 12, 20, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起婚嫁习俗",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 3, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "陕西省吴起县地税局税费收入突破17亿元大关",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 3, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "2012年吴起县人民政府工作报告",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 2, 22, 10, 32, 39)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起:昔日红军长征落脚地 如今退耕还林第一县",
                        Author = "杨涛",
                        Source = "吴起热线",
                        PubDate = new DateTime(2013, 2, 3, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县2013年春节文化系列活动安排",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 2, 3, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县文联《长征》文学季刊约稿启事",
                        Author = "杨涛",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2013, 2, 2, 10, 22, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县连续七届蝉联陕西县域经济社会发展十强县",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2012, 12, 7, 17, 25, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起县教育局2012年招聘教师公告",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2012, 12, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "丰收的田野：延安吴起新养殖 生态养鸡上市",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2012, 3, 22, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "2011年吴起县人民政府工作报告",
                        Author = "Webdiyer",
                        Source = "吴起政府网",
                        PubDate = new DateTime(2012, 3, 2, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "吴起采油厂原油年产突破200万吨文艺晚会",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2011, 11, 28, 0, 0, 0)
                    });
                arts.Add(new Article
                    {
                        Title = "[新闻调查]吴起：免费教育实验",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2011, 2, 3, 0, 0, 0)
                    });
                arts.Add(new Article
                {
                    Title = "吴起退耕还林“还出”一片秀美山川",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2012, 4, 3, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县铁边城入围全省31个文化旅游名镇",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2014, 4, 3, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "再到吴起观“绿海”",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2014, 8, 13, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县入选2013中国中小城市百强县市",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2013,11, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "延安至吴起高速公路12月中旬通车",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2013, 12, 3, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起：从贫困县到全国百强",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2014, 5, 13, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起特色养殖成农民致富首选",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2014, 3, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县退耕村民生产生活方式改变",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2013, 9, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起：从一个“贫困县”到全国“百强县”",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2014, 1, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起:退耕还林让黄土山峁再披绿装",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2013, 9, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县统筹引领县域经济向纵深发展迈进",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2013, 9, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起热线微信公众号上线",
                    Author = "Webdiyer",
                    Source = "吴起热线",
                    PubDate = new DateTime(2014, 12, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县巩固全国文明县城成果纪实",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2013, 9, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "吴起县举办200余场陕北说书",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2013, 9, 22, 0, 0, 0)
                });
                arts.Add(new Article
                {
                    Title = "电影《山丹丹花儿开》在陕西省吴起县开拍",
                    Author = "Webdiyer",
                    Source = "吴起政府网",
                    PubDate = new DateTime(2013, 9, 12, 0, 0, 0)
                });
                
                return arts;
            }

        }

        public static Article ArticleWithContent
        {
            get
            {
                return new Article
                    {
                        Title = "吴起婚嫁习俗",
                        Author = "Webdiyer",
                        Source = "吴起热线",
                        PubDate = new DateTime(2011,3,5),
                        Content =
                            "<div> 婚嫁即娶媳妇、嫁姑娘的仪式（俗称“过红事”或“喜事“吴起的传统婚嫁，礼仪繁冗，讲究很多，县内也有南北东西之区别，但一般都有以下程序。</div> <h4> 打问亲事</h4> <p> 未婚男女，经人传话，双方互相打问，了解对方年龄、相貌、人品、文化、职业、家庭门风等是否般配，确定是否联姻。</p> <h4> 看家见面</h4> <p> 经了解联姻双方父母及子女基本同意后，先请一个说媒人，由媒人牵线，女方父（母）和女儿到男方家看家居环境见面。一般互问家庭状况孩子爱好、志趣及将来打算。主要是让女方更全面地了解男方及其家庭情况。古语说得好：“男怕选错行，女怕嫁错郎”，这次见面非常重要，基本确定双方是否同意结亲。男女双方也可以单独会面谈心，更进一步地了解对方。</p> <h4> 接把柄</h4> <p> 看家见面经过互相了解谈心，如双方父母和儿女都同意结亲，男女双方要互送定亲信物，俗称“接把柄”。如未“接把柄”就说明有一方不愿结亲，婚事就无法再说下去了。媒人会婉转地向另一方说明。</p> <h4> 定亲</h4> <p> 男女双方同意联姻后，择吉日，由男方带烟酒、衣服，与主事人一般为父亲）、媒人到女方家，经媒人说合，商定好彩礼（男方给女方的财物）互相敬酒，婚姻就算正式确定了。</p> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 行礼议话</h4> <p> 是联姻过程的一重大仪式。男青年由媒人及家长陪同，带一只宰杀的羯羊、烟酒等物到女方家，女方请女子的外家、家门（户族）及主要亲戚相聚，叙情说亲。双方男女及家长当着众亲友商定婚事并交付彩礼，讲定女方所要的衣饰、家什和女方主要陪嫁物，并正式商定办理结婚手续时间和娶亲的日子，男方将事先选定的过门日子通知女方。并商定娶送人的有关事宜，如参加娶送人数，动用什么牲口或多少车辆等。这一次就要将结婚贺喜的所有事情都确定好，以便双方做好准备。</p> <h4> 办理结婚手续</h4> <p> 按照行礼议话时确定的时间，男女双方在规定的政府机关办理结婚手续（现在还要经过婚前医学检查）。这是确定法定婚姻的一项程序。只要符合《中华人民共和国婚姻法》规定的法定条件，即可办理结婚登记手续，婚姻关系依法正式确立。</p> <h4> 订吹手</h4> <p> 预订一支鼓乐队为婚庆助兴。订吹手时要交定钱，预示双方要信守诺言，否则过事时吹鼓手可以不履约。</p> <h4> 贺喜</h4> <p> 双方按照议话时商定的娶亲日子，将新娘娶回新郎家即为贺喜。这是婚礼程序中最为隆重的仪式。这天，男女双方的亲朋好友都要分别来到两家参加送、娶仪式，男方娶人的先来到女方家，行完娶人礼，吃毕酒席，然后由女方送人的陪上新娘和娶人的共同来到男方家。这天，送、娶的程序有很多讲究。</p> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 媵马</h4> <p> 就是新娘骑乘的马。要给媵马戴红脑缨和串铃，鞴好鞍韂，驮上新人的铺盖衣物等。男方娶人的未起程前，新郎先要骑一下媵马，叫“压媵马”．意思是看马是否合适，鞍子备好了没有。媵马要用未阉的公马、公驴充当现在大多不用牲口，而是用汽车，但新郎还要在车里坐一坐，以示压媵马的程序。</p> <h4> 媵衣</h4> <p> 即新娘穿的结婚衣服。全部由新郎家准备。贺喜那天由男方娶人的全部带到女方，经清点后交给女方，新娘在离开娘家之前要将平时穿的衣服全部换掉，穿上结婚新衣（媵衣）迎娶。</p> <h4> 照妖镜</h4> <p> 新娘迎娶的过程中身上佩带的镜子。旧时一般用铜镜。给镜子穿一条布带绑在新娘的腰里。新娘上马时镜子在新娘的背后，走过一半路后要换在前胸，意即辟邪。</p> <h4> 彩子布</h4> <p> 即红盖头。多用大花红布（丈二长）中间绑一朵大花，新娘顶在头上，两头披肩下垂。一为遮羞避尘，二为吉利美观，增加喜庆气氛。现在坐车互有顶红头纱的。</p> <h4> 迎亲人</h4> <p> 贺喜的那一天，男方要先到女方娶亲。娶亲人由介绍人、代事人、娶人婆姨（有配偶的妇女，多由新郎的嫂子、婶娘充当）、拉马人、驮箱子的人（专门运输女方陪嫁箱子的人）及一班吹鼓手组成，娶亲人必须是单数（加上要娶的新娘就成了双数）。</p> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 送人的</h4> <div> 即陪送新娘的人。两位送人婆姨（一般为新娘的姑姑、姐姐或嫂子）和女方外家、姨家、姑家亲戚及本家爷爷、兄弟和族中各辈人组成。送人的人数一般是娶亲人数的两倍左右。</div> <h4> 拉马娃娃</h4> <div> 为新娘牵马的人。选择新郎的弟弟或侄儿一人，年龄在十五六岁，为新娘牵马，叫拉马娃娃。现在虽用车娶，仍要指定一人为拉马娃娃。</div> <h4> 过夜、打当儿</h4> <div> 这是根据嫁娶双方路途远近而定，路途远的，娶人的要在女家住一夜，叫“过夜”，路途近的、当日可娶回的叫“打当儿”。</div> <h4> 女方待客</h4> <div> 贺喜日，女方在新娘嫁走前也要待客，女方待客也要吃三顿饭，顺序同男方，待客所用烟、酒、茶饭一般都是在议话时商量好的，基本与男方相同，也有档次略低一点的。</div> <h4> 搂马人</h4> <div> 即嫁娶时一路保护新娘的人。一般由新娘的兄、弟、父辈中强壮男子充当，至少两人。在新娘上马前要由娶方的代事人给搂马人敬一杯酒，行话叫“看盅”，表示请到。</div> <h4> 押箱人</h4> <div> 押运女方陪嫁物的人。一般由新郎姐夫和女外家各一人承担。娶人之日，女方酬客结束后，押箱人要将女方陪嫁物装箱由牲畜驮运（较娶送人的提前出发）回到男方。现在都是装车同时出发。</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 嫁妆</h4> <div> 女方为新娘陪送的服装等物，一般有衣服、鞋、鞋垫、被褥、毛毯等，也有陪送家什电器的。出嫁女儿的陪嫁物品，要有两张红纸写的贺礼单：一张叫陪方单，一张叫添箱单。陪方单上首先写东主（即新郎家）送来的东西，接着写外家行的礼，娘家陪嫁的东西。添箱单上写的是哥嫂、姐妹、姑姨、叔婶们送给新娘的东西，大多是鞋袜手帕之类的小物件。小物件的叫法、用语也有讲究。比如男鞋要叫“乾履成双”，女鞋要叫“坤履成对”，小针线活叫“耍花一串”等，最后要写上“鸳鸯（枕头）一对，锁钥俱全”。</div> <h4> 撒箱</h4> <div> 女方陪嫁物和亲友的贺礼收起后，双方的主事人要清点交接，人箱上锁，以备运往婆家。锁箱前男女双方父母（或其他长辈）要往箱内放“撒箱钱”，女方先放，男方后放，男方放的钱数必须是女方的2倍，钱数由双方事先商定，数量不等。原则是：既显富贵、大方，又不难为亲戚、伤了和气。</div> <h4> 上马</h4> <div> 新娘上马是出嫁女子最隆重的仪式。鼓乐鞭炮齐鸣，搂马人面南而立。新娘在厨房由娶送人婆姨为其穿“媵衣”，搭蒙头。当一切就绪，女方管事人高声宣布新人上马后，搂马人将新娘从炕上抱起，一直要抱到马背上（新娘从上马到男方铺床前这段时间脚不能沾地）。新人一上马，迎送亲的队伍就浩荡起程。</div> <h4> 接路</h4> <div> 也叫挡路。迎亲队伍返回路上，凡经过大小庄头村镇，娶人队伍中的乐班都要鼓乐齐鸣，所经过的庄里人要在路边上支起桌子，摆上酒、水款待，称“接路”或“挡路”。由娶人的代事人和挡路的代表互相揖让，招呼队伍小憩。娶送人的也有人喝点水，以解路途劳渴，然后起身上路。娶人的要给挡路的送两盒烟，以示谢意。其实挡路人都是新郎家事先安排好的，以便在新亲戚面前显示人缘宽广。</div> <h4> 讨花红</h4> <div> 估计迎亲人马快回来时，新郎要给自己的外家人摆桌子上酒菜“讨花红”（即贺礼，男方外家给外甥的被面），将讨来的“花红”斜搭在左肩右腋下，称“挂花红”。若花红被面是两匹以上者可交叉披挂在双肩上。</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 订帐</h4> <div> 在新娘快娶回来时，洞房要“订帐”，即把洞房内所有陈设摆放好，然后在洞房门前用红线牵挂彩布。订帐后除新郎外一切人不许人内。</div> <h4> 麻媳妇</h4> <div> 迎亲的队伍讲究黄昏回来，新娘在天麻黑时娶到家，称“麻媳妇”迎亲队伍回到村庄时，主家备有两支火把在村口迎接，一直迎至院内，此时院内外灯火通明，鞭炮齐鸣。</div> <h4> 抱宝斗入洞房</h4> <div> 新娘娶回到院子里，待宾客到齐后，管事人（司仪）宣布新人“下马”。同时高声喧叫给娘、外家人看盅，给搂马人看盅。管事人喧叫后被招呼的人要搭礼回话，说：“免礼了。”新娘下马后，与新郎并肩面桌而立，管事人开始主持婚礼，婚礼程序有繁有简，多以逗人取乐为主。仪式进行完后，管事人大声宣布：“抱宝斗人洞房”新郎抱起装有粮食的升子和新娘一起进入洞房。现在都改为抱花瓶入洞房，新郎新娘各持花瓶，脚踩毛毡（新郎新娘所站处铺一条毛毡或从所站处到洞房门口一直都铺毛毡），并排前进，前面另有一人开路，打开洞房门，新郎新娘同时进入洞房。也有二人争先人洞房的讲究（叫抢帐），即谁先进入洞房，意为谁强大。</div> <h4> 儿女馍馍</h4> <div> 手郎新娘入洞房后，窗外边由嫂子、奶奶准备几个馍馍（即馒头）将窗纸打破，把馍馍扔进屋里，意求早生儿女。</div> <h4> 拦门</h4> <div> 拦门的含意有二：一为来宾洗尘，二是清点来宾是否到齐或有无不合规定的人员。这是婚嫁双方都要举行的一个仪程。送人的来宾只能是新娘外家、姑家、姨家及同族家门，其他外姓一律不接待，若女方属小户人家，邻里中的外姓送亲要事先告知男方，否则有可能当面给难堪，甚至劝其离开。拦门的时间为新娘人洞房后；拦门的地点在院子里。拦门时，摆上酒宴，女方送人人的全部人座并由男方外家一人陪坐，首座由介绍人居中，儿女外家侧座，其他人按辈分依次入座。酒为实用，菜肴有实用的，有虚设的（素者实用，荤者虚设）。席中斟酒就绪，新郎作揖问候，方可开饮。一般酒过三巡，即可撇下。拦门时管事人也要说一段顺口溜：“今是古，古是今，自古攀亲到如今，某府亲戚翻山越岭，满面春风，给我们送来了新人，请你们坐在桌前喝上两杯喜酒，洗一洗灰尘。”</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 铺席</h4> <div> 这是洞房里的主要活动。这一活动由娶送人婆姨主持。用物有梳子、镜子、酒杯、核桃、红枣、花生等。娶送人婆姨将新郎新娘的被褥反铺在炕上，新郎穿上新娘为其做的“趿帐鞋”，沿床铺四边走一遍，然后新郎新娘背靠背坐在坑上，娶送人婆姨一人持镜，一人为新娘重新梳头，并将新娘的长发搭在新郎的头顶上慢慢梳理，意为白头到老，永不分离（也叫“并头”）。接下来喝交杯酒，一杯酒由新郎新娘各喝一半。娶送人婆姨再将反铺的被褥翻正，并说“翻人身”等话语。最后将核桃、红枣、花生之类分别撒在床上或压在被褥底下。边撒边说：“双双核桃双双枣，双双儿女满院跑，养女子要巧的，石榴牡丹冒铰的；养小子要好的，戴顶子穿袍子。”意为早生儿女，财帛有余。</div> <h4> 点长命灯</h4> <div> 洞房里要点两支红蜡烛或两盏清油灯，彻夜不熄，有电灯也要点。意即夫妻俩长长久久，长明（命）不灭（亡）。</div> <h4> 耍房、听门</h4> <div> “铺床”结束后，新郎新娘的朋友、同学、战友要进去和新郎新娘玩闹一会儿，以增添喜庆气氛。当人们都睡定以后，新郎的奶奶、嫂子、小姑、小叔等人会悄悄来到帐房门外，偷听新郎新娘在里面拉什么话。一来观察两人的感情，二来以资以后玩笑。也有个别抱孙子心切的婆婆也去听门。</div> <h4> 正日</h4> <div> 正式待客的日子，也叫“肥日”，在女方是上马的日子，在男方是新娘娶回的第二天。</div> <h4> 扶头</h4> <div> 正日凌晨，新郎要为大客（即送嫁的人）、媒人、外家人施礼，请其起床洗漱叫“扶头”。由一女孩为新娘端洗脸水，新娘要送给女孩一工艺讲究的扎绣品（称“耍花”）为酬礼。</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 吃茶馃</h4> <div> 这是正日的第一顿饭，即用一些油炸食物、点心伴饮茶水。</div> <h4> 吃油饴恪</h4> <div> 这是正日的第二顿饭。即吃吴起特产的荞面饴铬，汤里除了臊子外全是清油，并炼熟一盆子黄芥油放在饭桌上，再配有许多小菜，由客人根据自己的口味食量随便调食。油饴铬拌小菜非常好吃，很多赶事情的就是奔这一顿饭来的，油饴铬吃好了，就觉得这个事情过得好，赶得值。</div> <h4> 拜祖</h4> <div> 这是旧时正日一项重大活动，院子中央支一张桌子摆上饭食、酒菜，有影的人家把影（先祖像布）挂起，无影的放几个祖先的牌位，或写一“供奉某门宗祖三代之灵位”的牌子放在桌上。新郎家的男人和婆姨按辈分，一辈一辈排队，行三叩九拜礼，现在已被取消。</div> <h4> 记礼</h4> <div> 认大小之前要记礼，订一个专门的礼簿，支一张桌子，摆上烟、酒，由一名有文化的人记礼，一人收礼（记礼和收礼人多为女婿客），先从外家开始，逐一记收来宾所带的礼。过红事行礼，过去都有一些不成文的规矩和专门的用语。男外家客行的礼叫“花红”即是被面，没有被面的年代也要扯丈二花布给新郎披在肩上，新郎挂披得越多，越显示外家的富有；女外家行的礼叫“铺盖”，过去是毛毡、被子，现在改为毛毯，有全铺和半铺之分，行全铺礼的到了新郎家要给女外家人退还一半（折合成现金）。男女外家行的礼，是最多的，因此也最受尊重，事情上所有事唯外家人的马头是瞻，其他人都不能超过。但那是老讲究，现在同学、朋友行的礼都超过了外家人。女婿、外甥娶媳妇要行袜子礼，出嫁女儿要行中衣礼；亲戚朋友行朋亲礼，这没有具体规定；出嫁女儿家门只填箱。娶媳妇家门只放拜礼，不记礼。</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 认大小</h4> <div> 也叫“放拜礼”或“串拜钱”。凡来参加男方婚礼的亲戚、同族及新郎的父母等都要为新郎新娘放拜礼，新郎的小辈人和弟妹不放。放拜礼时，摆一张桌子，由司仪主持，新郎新娘并排站在桌子前方；放拜礼的人（拜礼钱数不限）每放一人，司仪就要向新人告诉是什么亲戚关系，新郎新娘要行一次礼，以示认大小，是长辈的施以磕头礼，平辈的由新郎作揖。放拜礼进行中，新郎的爷辈、友人，特别是姐夫要与新郎新娘打趣逗笑一番，以增加喜庆气氛。放拜礼结束后，由新郎的姑夫将拜礼钱平分给二位新人。</div> <h4> 进门</h4> <div> 进门是新娘过门第一次进厨房。新郎新娘并行进入厨房后，新娘要将家人故意撒在地上的灶具一一捡起，也有故意将缝衣针扔在地上，让新娘捡，以试新娘手巧不巧：然后新郎新娘来到灶前“揭碗子”。灶台上放两个盖着的碗，一碗盛饭，一碗盛钱，两位新人手臂交叉揭开碗盖。之后新娘要在厨房炕上坐一会儿，并将婚前准备好的针线活（枕头顶子、枕套、鞋、鞋垫等）分散给婆家的人和男方的姑表长辈，为进门礼物。进门时有些能说会道的管事人也要说上一套吉利话，大意是“太阳出来一点红，新人离开洞房门，进了厨房拜灶神，头上梳起一盘龙，左插金、右戴银；脚下忽忽有风声，左脚踏白虎、右脚踏青龙；能描花，能绣凤，针线茶饭样样精。老婆婆高兴的笑盈盈，年底抱个小儿孙”。</div> <h4> 吃偏饭</h4> <div> 早饭后至坐正席前多安排的一顿饭，招待的对象是娶送人婆姨、吹鼓手和帮忙代劳的。饭食主要是花儿馍馍，也有吃面条的。</div> <h4> 缤摆</h4> <div> 也叫“亮箱”或“踩陪匹”，男女双方都要搞的一个仪式。女方在出嫁时举行叫“添箱”或缤摆，仪式比较简单。男方的则红火热闹，就是将新娘箱中双方购置的衣物以及女方陪嫁物全部展示到院中央，以显富贵丰盛。双方主事人互相整点物件，由吹鼓手环绕各类嫁妆三吹三打，亲朋好友皆前来观看，吹鼓手吹奏之中，主家或友人将零碎钱或点燃的烟卷放置各处让吹鼓手拈，吹鼓手不能停止吹奏，还要把钱物拿到，常会耍出各种技艺，惹逗得观众哄笑连天。</div> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 谢客</h4> <div> 缤摆或认大小结束时管事人要向客人们说一些客套话，一方面对来客的祝贺帮忙表示谢意，另一方面对主家没有招待好表示歉意。其中最为有趣的是向外家人、媒人、厨师、吹鼓手说的谢词。向外家人说的是：“今是古，古是今，盘古开天到如今。天上有个蟠桃会，地下有个儿女亲。蟠桃会会的是各路神仙，儿女亲会的是老小外家。给老小外家看杯，新人有礼。”向媒人说的是：“天上无云不下雨，地上无媒不成亲，青山跑成白路，鞋底子磨透，两家的闲话受够，如今大事成就。酒一瓶，肉一方，白面馍馍尽你装，看盅，新人有礼！”对厨师说的是：“某某师傅手手巧，各样调料放得好，生的做熟，硬的煮烂，得到各位客人的称赞，来时穿的青衣蓝衫，现在滚的油渍果眼，有心给你换上两件，主家还有些不便，酒一瓶，肉一方，白面馍馍尽你装，看盅，新人有礼了！”对吹鼓手说的是：“鼓乐师傅辛苦了，走时吹的将军出阵，回来吹的得胜回营，给我们迎来了满门人，两家合成一家人。一杯水酒相谢，新人有礼。”对送人的大客说的是：“你们住的高楼大厦，我们住的茅庵草舍，你们吃的山珍海味，我们吃的粗茶淡饭，你们是八仙桌子太师椅，我们是榆木桌子烂板凳，吃苦受累说不成，给我们送来了满门人，一杯水酒相谢，新人有礼。”最后还要对所有帮忙代劳的都说一番感谢的话：“剥葱的，捣蒜的，担水的，扫院的，圪里圪瘩乱串的，总而言之，一杯水酒相谢，新人有礼。”这些说词没有一定格式，可多可少，可文雅，可诙谐，都是由管事人现场编撰说出，主要是为了给喜事增添喜庆气氛，惹逗客人们一笑。像对吹鼓手能开玩笑的就有另一种说法：“铜头子，木杆子，八个指头按眼子，眼睛瞪得像兔卵子，喇叭头、妥子淌的水点子，辛苦了，一杯水酒相谢！”</div> <h4> 正席</h4> <p> 即正日摆的酒席。吴起的正席讲究很多，首先是饭、菜、酒的讲究，酒宴一般为“十全”（十碗菜）、“十三花”（十三碗菜），喝酒菜有干果、鲜果、鸡、鱼、猪肉、羊肉等荤素搭配，吃饭的菜都是蒸碗子、有荤有素。所饮酒是家造酒、白酒、甜酒、啤酒多管齐下。酒过数巡，主家要分别为宾客斟酒敬烟；然后由新郎新娘为席间所有宾客敬酒敬烟。敬酒一般用两种酒，即白酒、葡萄酒，男的敬白酒，女的敬葡萄酒。敬酒一般都必须喝，确实不喝酒的可以请同桌人代喝。酒宴期间划拳、摇宝、打通关占用时间较长，一般待一轮客得3个小时左右，坐席的人互相要猜拳行令，主家还要选出一些酒量大、拳划得好的人与送人的进行挑战。在撤酒席时，还要留一桌供爱耍的人继续划拳比试。一次酒席都要有几个喝醉酒的人，这才叫喝好了，事过好了二酒喝好后，桌上的菜肴要全部撤掉，再重新上一茬吃饭的菜，菜的摆放也有讲究，不能随便乱放。宴席上的主食为白面蒸馍。宾客的坐位也有讲究，分首席（男女外家人坐），偏席（按辈分由近及远分别坐），普通席（其他宾客随便坐）。正席结束即为婚庆结束。</p> <h4> 首席</h4> <p> 在正日所有的席桌中，其中有一桌为首席，首席的上座为男女外家。正高工菜、敬酒等各种礼仪都首先从首席开始，当地流传一句俗语就是“吃酒望上席（首席）”，可见首席在酒宴中的位置之重要。</p> <div style=\"page-break-after: always\"> <span style=\"display: none;\">&nbsp;</span></div> <h4> 陪客</h4> <p> 或叫“站席口”。代替主人劝客吃酒饭者。在吴起的酒席上，主人总要每桌指定一名陪客，为客人倒酒、递烟、招呼客人吃好：家门、亲戚、朋友、左邻右舍，均可充当陪客。</p> <h4> 响堂</h4> <p> 敬重外家人的活动，使之体面高兴。在正高上吹鼓手向首席人专门奏乐领取赏钱即为响堂。在正席上主家看过酒后，管事人会问首席的男女外家“要不要红火一下”？征得同意，并商定赏钱后，吹鼓手三吹三打并向首席上座的人“讨赏”，三吹三打一次为一堂。有响一堂的，也有响两堂的。在女方，赏钱由女外家承担，在男方，赏钱由男方外家承担，或给谁响堂，由谁出钱。其他酒桌的人为了凑热闹也可以约吹鼓手响堂。</p> <h4> 回门</h4> <p> 即新女婿回拜妻家。婚庆结束后，新媳妇将洞房门和箱柜上的钥匙交给婆婆，新郎新娘及送人的一同返回娘家，称回门。新郎到妻家后，仍然要看盅、作揖，认大小，女方客人、族中长辈要为新郎放拜礼，礼钱全归新郎一人。岳父母要为女婿摆宴，新郎官要坐上席（这是一种礼节，多数新郎把坐位让给年长者）。吃饭照例有一顿饺子，包饺子时，妻弟、妹要开新郎的玩笑，在饺子中包上辣椒、食盐、豌豆、草节等杂物，以观新郎的精明程度。回门在娘家住的时间一般为一天。</p> <h4> 站对月</h4> <p> 从新娘出嫁的那日算起，包括回门在娘家住的天数，或七天，或八天，新娘再去娘家住同样的天数称“站对月”。也有说“婆七、娘八”的（即新娘在婆家住七天，娘家住八天）。新娘到婆家的第一个夏天要回娘家避暑，从一伏到三伏，大致一个月时间。</p> <h4> 新人拜年</h4> <p> 新婚后的第一个春节，新婚夫妇在正月初旬要带上礼品给户家、女方长辈、男方外家中长辈去拜年。接受尊拜的长辈要给新婚夫妇一定的拜钱。</p>"

                    };
            }
        }
    }
}